app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `remember_token`, `login`, `email`) VALUES('', '934b72c1e6af8d1799c0f54b0ad886deb925b424', '2009-07-12 18:00:40', NULL, 'c5dd522fdb8ab73405a29f742f9c9dc707fa4586', NULL, '2009-07-12 18:00:40', 'b33ad94d47ed909d8d248b283f303c75321f879f', NULL, 'quire', 'quire@example.com')

  def activate
    logout_keeping_session!
    @page_title = "Activation"
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM `users` WHERE (`users`.`activation_code` = '1b6453892473a467d07372d45eb05abc2031647a') LIMIT 1